
const {cmd , commands} = require('../command')

cmd({
    pattern: "menu",
    desc: "menu the bot",
    category: "menu",
    react: "🗒️",
    filename: __filename
},

async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{

let dec = `*UMAR XD*

> UMAR ALL MENU💗

🧬◦ *ɴᴀᴍᴇ ʙᴏᴛ* : ❖sɪʟᴇɴᴛ-sᴏʙx-ᴍᴅ❖
🧬◦ *ᴄʀᴇᴀᴛᴏʀ* : ➺ѕเℓεɳƭ_ℓσѵε૨࿐⚡
🧬◦ *ᴠᴇʀsɪᴏɴs* : ᴠ.2.0.0⚡
🧬◦ *ᴍᴇɴᴜ ᴄᴍᴅ* : ᴍᴇɴᴜ⚡
🧬◦ *ꜱᴜʙꜱᴄʀɪʙᴇ ᴍʏ ʏᴛ ᴄʜᴀɴɴᴇʟ* :  https://youtube.com/@silentlover432 ⚡
🧬◦ *ᴊᴏɪɴ ᴍʏ ᴄʜᴀɴɴᴇʟ* :  https://whatsapp.com/channel/0029VaHO5B0G3R3cWkZN970s ⚡
🧬◦ *ᴄᴏɴᴛᴀᴄᴛ* : http://wa.me/+923096287432 ⚡

*┌ 乂📥 ＤＯＷＮＬＯＡＤＥＲ📥 乂*
*│◦ .ғʙ <ᴜʀʟ>*
*│◦ .ɪɴꜱᴛᴀ <ᴜʀʟ>*
*│◦ .ᴠɪᴅᴇᴏ <ᴜʀʟ>*
*│◦ .ɢᴅʀɪᴠᴇ <ᴜʀʟ>*
*│◦ .ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>*
*│◦ .ᴛᴛ<ᴜʀʟ>*
*│◦ .ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>*
*│◦ .ꜱᴏɴɢ <ϙᴜᴇʀʏ>*
*│◦ .ꜱᴏɴɢ <ᴜʀʟ>*
*│◦ .ᴠɪᴅᴇᴏ <ϙᴜᴇʀʏ>*
*│◦ .ᴠɪᴅᴇᴏ <ᴜʀʟ>*
*│◦ .ɪᴍɢ <ϙᴜᴇʀʏ>*
*└◦ .ᴀᴘᴋ <ɴᴀᴍᴇ>*

*┌ 乂 🔎 S E A R C H 🔍乂*
*│◦ .ʏᴛꜱ  <ᴛᴇxᴛ>*
*│◦ .ʏᴛꜱ1 <ᴛᴇxᴛ>*
*│◦ .ᴍᴏᴠɪᴇ <ᴛᴇxᴛ>*
*└◦ .ɪᴍɢ <ᴛᴇxᴛ>*

*┌ 乂 🧠 ＡＩ 🧠*
*│◦ .ɢᴘᴛ <ᴛᴇxᴛ>*
*└◦ .ᴀɪ <ᴛᴇxᴛ>*

*┌ 乂 👨‍💻ＯＷＮＥＲ 👨‍💻*
*│◦ .ꜱᴜᴘᴘᴏʀᴛ*
*│◦ .ꜱᴇᴛᴀᴜᴛᴏʙɪᴏ*
*│◦ .ᴍᴜᴛᴇ*
*│◦ .ᴜɴᴍᴜᴛᴇ*
*│◦ .ᴏᴡɴᴇʀ*
*│◦ .ʀᴇᴘᴏ*
*│◦ .ꜱʏꜱᴛᴇᴍ*
*│◦ .ꜱᴛᴀᴛᴜꜱ*
*│◦ .ʙᴏᴛɪɴꜰᴏ*
*└◦ .ʀᴇꜱᴛᴀʀᴛ*

*┌ 乂 👥 ＧＲＯＵＰ 👥*
*│◦ .ʀᴇᴍᴏᴠᴇ <ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍsɢ ᴜ ᴡᴀɴᴛ ᴛᴏ ᴅᴇʟᴇᴛᴇ>*
*│◦ .ᴅᴇʟᴇᴛᴇ <ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍsɢ ᴜ ᴡᴀɴᴛ ᴛᴏ ᴅᴇʟᴇᴛᴇ>*
*│◦ .ᴀᴅᴅ*
*│◦ .ᴋɪᴄᴋ*
*│◦ .sᴇᴛɢᴏᴏᴅʙʏᴇ <ᴛᴇxᴛ>*
*│◦ .sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>*
*│◦ .ᴘʀᴏᴍᴏᴛᴇ*
*│◦ .ᴅᴇᴍᴏᴛᴇ*
*│◦ .ꜱᴜᴘᴘᴏʀᴛ*
*│◦ ɢᴇᴛᴘɪᴄ*
*└◦ .ʟɪɴᴋ*

*┌ 乂 📃 ＩＮＦＯ 📃*
*│◦ .ᴍᴇɴᴜ*
*│◦ .ᴀʟɪᴠᴇ
*│◦ .ʀᴇʙᴏᴛ*
*│◦ .ʀᴇꜱᴛᴀʀᴛ*
*│◦ .ʙᴏᴛɪɴꜰᴏ*
*│◦ .ꜱᴛᴀᴛᴜꜱ*
*│◦ .ꜱᴜᴘᴘᴏʀᴛ*
*│◦ .ᴘɪɴɢ*
*└◦ .ꜱʏꜱᴛᴇᴍ*

*┌ 乂 🎡ＣＯＮＶＥＲＴＥＲ 🎡*
*└ ◦ .sᴛɪᴄᴋᴇʀ*

*┌ 乂 ⛱️ R A N D O M ⛱️*
*│◦ .ᴜᴍᴀʀ*
*│◦ .ᴅᴏɢ*
*│◦ .ᴀɴɪᴍᴇ*
*│◦ .ᴀɴɪᴍᴇɢɪʀʟ*
*│◦ .ᴀɴɪᴍᴇɢɪʀʟ1*
*│◦ .ᴀɴɪᴍᴇɢɪʀʟ2*
*│◦ .ᴀɴɪᴍᴇɢɪʀʟ3*
*│◦ .ᴀɴɪᴍᴇɢɪʀʟ4*
*└◦ .ᴀɴɪᴍᴇɢɪʀʟ5*

*┌ 乂 🏝️W A L L P A P E R🏖️*
*└◦ .ɪᴍɢ*

*┌ 乂 🔥 O Ｔ H E Ｒ 🔥*
*│◦ .ɴᴇᴡꜱ*
*│◦ .ᴡᴇᴀᴛʜᴇʀ*
*│◦ .ᴛʀᴛ*
*│◦ .ᴍᴏᴠɪᴇ*
*│◦ .ꜰᴀᴄᴛ*
*│◦ .ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*
*│◦ .ɢᴘᴀꜱꜱ*
*│◦ .ʜᴀᴄᴋ*
*│◦ .ǫᴜᴏᴛᴇ*
*│◦ .ꜱʀᴇᴘᴏ*
*└◦ .ᴅᴇꜰɪɴᴇ*

> *POWERED BY UMAR REHMAN*

*SOBXMD BY UMAR*
`
await conn.sendMessage(from,{image:{url: `https://telegra.ph/file/2a06381b260c3f096a612.jpg`},caption:dec},{quoted:mek});

}catch(e){
console.log(e)
reply(`${e}`)
}
})
